In [9]:
import pandas as pd

In [19]:
dataset = pd.read_csv("student.csv")

In [20]:
print(dataset)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3  aniket     BE  76.88   19
3     4  ajinkay    TE  69.66   20
4     5    asha     TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8     amit    BE  68.33   23
8     9     amol    TE  56.57   20
9    10    anmol    BE  78.66   21

In [21]:
type(dataset)

pandas.core.frame.DataFrame

In [22]:
dataset.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [23]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [26]:
dataset.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.481000  20.500000
std     3.02765   9.224172   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [31]:
dataset.head(7)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3  aniket     BE  76.88   19
3     4  ajinkay    TE  69.66   20
4     5    asha     TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19

In [37]:
dataset.iloc[0:15,0:13]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3  aniket     BE  76.88   19
3     4  ajinkay    TE  69.66   20
4     5    asha     TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8     amit    BE  68.33   23
8     9     amol    TE  56.57   20
9    10    anmol    BE  78.66   21

In [40]:
dataset.iloc[2,3]

76.88

In [75]:
dataset.iloc[:,[1,4]]

      name  age
0     anil   22
1     amit   21
2  aniket    19
3  ajinkay   20
4    asha    20
5   ayesha   20
6     amar   19
7     amit   23
8     amol   20
9    anmol   21